storage/tests/53acae6a-2eb6-466a-adf4-c36b22124d9d/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/53acae6a-2eb6-466a-adf4-c36b22124d9d/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 30s (gracefulStop: 30s)


running (0m00.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  00.9s/30s

running (0m01.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 1000 VUs  01.9s/30s

running (0m02.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  02.9s/30s

running (0m03.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  03.9s/30s

running (0m04.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 1000 VUs  04.9s/30s

running (0m05.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  05.9s/30s

running (0m06.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  06.9s/30s

running (0m07.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  26% ] 1000 VUs  07.9s/30s

running (0m08.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  08.9s/30s

running (0m09.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  09.9s/30s

running (0m10.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  36% ] 1000 VUs  10.9s/30s

running (0m11.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  11.9s/30s

running (0m12.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  12.9s/30s

running (0m13.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  46% ] 1000 VUs  13.9s/30s

running (0m14.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  14.9s/30s

running (0m15.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  15.9s/30s

running (0m16.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  16.9s/30s

running (0m17.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  17.9s/30s

running (0m18.9s), 1000/1000 VUs, 1 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  18.9s/30s

running (0m19.9s), 1000/1000 VUs, 4 complete and 0 interrupted iterations
default   [  66% ] 1000 VUs  19.9s/30s

running (0m20.9s), 1000/1000 VUs, 12 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  20.9s/30s

running (0m21.9s), 1000/1000 VUs, 20 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  21.9s/30s

running (0m22.9s), 1000/1000 VUs, 28 complete and 0 interrupted iterations
default   [  76% ] 1000 VUs  22.9s/30s

running (0m23.9s), 1000/1000 VUs, 36 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  23.9s/30s

running (0m24.9s), 1000/1000 VUs, 49 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  24.9s/30s

running (0m25.9s), 1000/1000 VUs, 58 complete and 0 interrupted iterations
default   [  86% ] 1000 VUs  25.9s/30s

running (0m26.9s), 1000/1000 VUs, 67 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  26.9s/30s

running (0m27.9s), 1000/1000 VUs, 72 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  27.9s/30s

running (0m28.9s), 1000/1000 VUs, 75 complete and 0 interrupted iterations
default   [  96% ] 1000 VUs  28.9s/30s

running (0m29.9s), 1000/1000 VUs, 76 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  29.9s/30s

running (0m30.9s), 0998/1000 VUs, 79 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m31.9s), 0993/1000 VUs, 84 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m32.9s), 0986/1000 VUs, 91 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m33.9s), 0975/1000 VUs, 102 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m34.9s), 0970/1000 VUs, 107 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m35.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m36.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m37.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m38.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m39.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m40.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m41.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m42.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m43.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m44.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m45.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m46.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m47.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m48.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m49.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m50.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m51.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m52.9s), 0969/1000 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m53.9s), 0968/1000 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m54.9s), 0968/1000 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m55.5s), 0968/1000 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m55.9s), 0968/1000 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m56.9s), 0968/1000 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m57.9s), 0968/1000 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m58.9s), 0968/1000 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m59.9s), 0968/1000 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s


  █ TOTAL RESULTS 

    checks_total.......: 916    15.260154/s
    checks_succeeded...: 47.59% 436 out of 916
    checks_failed......: 52.40% 480 out of 916

    ✗ status ok
      ↳  47% — ✓ 436 / ✗ 480

    HTTP
    http_req_duration..............: avg=18.33s min=3.71ms med=7.82s  max=59.8s  p(90)=49.89s p(95)=54.77s
      { expected_response:true }...: avg=2.15s  min=3.71ms med=8.07ms max=30.03s p(90)=7.89s  p(95)=10.98s
    http_req_failed................: 52.40% 480 out of 916
    http_reqs......................: 916    15.260154/s

    EXECUTION
    iteration_duration.............: avg=26.75s min=18.44s med=25.2s  max=53.52s p(90)=33.66s p(95)=34.05s
    iterations.....................: 109    1.815892/s
    vus............................: 968    min=968        max=1000
    vus_max........................: 1000   min=1000       max=1000

    NETWORK
    data_received..................: 395 kB 6.6 kB/s
    data_sent......................: 439 kB 7.3 kB/s



running (1m00.0s), 0000/1000 VUs, 109 complete and 968 interrupted iterations
default ✓ [ 100% ] 1000 VUs  30s